
ooRexx> call loadUnicodeCharacterNames
Load the Unicode character names 15.1.0 
............................................
Total loaded character names: 149813
Total character name aliases: 473
Unicode character intervals not expanded, execute: call expandUnicodeCharacterIntervals


----------------------------------------------------------------
-- Text encoding - Compatibility with String
-- Automatic conversion of String literals to RexxText instances
----------------------------------------------------------------

/*
Compatibility with the class String.
This is a work in progress, many methods not yet supported,
Unicode implementation still missing for many methods.
*/

/*
This string is used in several places:
"noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"
Depending on your editor/browser, you may see 5 emojis, or 3 emojis.
With Unicode 13, the display is 3 emojis (woman + family + father christmas).
ðŸ‘©	U+1F469	WOMAN
â€	U+200D	ZERO WIDTH JOINER
ðŸ‘¨	U+1F468	MAN
â€	U+200D	ZERO WIDTH JOINER
ðŸ‘©	U+1F469	WOMAN
â€	U+200D	ZERO WIDTH JOINER
ðŸ‘§	U+1F467	GIRL
ðŸŽ…	U+1F385	FATHER CHRISTMAS

Notice that ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ constitute only 1 grapheme thanks to the ZERO WIDTH JOINER.
*/


ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~description=
'UTF-8 not-ASCII (6 characters, 12 codepoints, 34 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~c2u=
'U+006E U+006F U+00EB U+006C U+1F469 U+200D U+1F468 U+200D U+1F469 U+200D U+1F467 U+1F385'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~c2x=
'6E 6F C3AB 6C F09F91A9 E2808D F09F91A8 E2808D F09F91A9 E2808D F09F91A7 F09F8E85'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~c2g=
'6E 6F C3AB 6C F09F91A9E2808DF09F91A8E2808DF09F91A9E2808DF09F91A7 F09F8E85'


/*
Two RexxText values are considered equal if their extended grapheme clusters
are canonically equivalent.This is used by the Swift language.
Q&A: https://lists.isocpp.org/sg16/2018/08/0121.php

TODO: confirm that it's NFC, and only that.
The definition of canonical equivalence by the Unicode standard seems not
limited to NFC. https://unicode.org/notes/tn5/
*/

/*
The strict comparison operators use the NFC normalization.
After normalization, they delegate to the String's strict comparison operators.

The non-strict comparison operators use the NFKD normalization plus
    stripIgnorable:.true
    lump:.true
After normalization + transformations, they delegate to the String's non-strict
comparison operators. Thanks to the lump transformation, all the Unicode spaces
are supported.
*/

ooRexx> textNFC = "NoÃ«l"~NFC
ooRexx> textNFC~UnicodeCharacters==
an Array (shape [4], 4 items)
 1 : ( "N"   U+004E Lu 1 "LATIN CAPITAL LETTER N" )
 2 : ( "o"   U+006F Ll 1 "LATIN SMALL LETTER O" )
 3 : ( "Ã«"   U+00EB Ll 1 "LATIN SMALL LETTER E WITH DIAERESIS" )
 4 : ( "l"   U+006C Ll 1 "LATIN SMALL LETTER L" )
ooRexx> textNFD="NoÃ«l"~NFD
ooRexx> textNFD~UnicodeCharacters==
an Array (shape [5], 5 items)
 1 : ( "N"   U+004E Lu 1 "LATIN CAPITAL LETTER N" )
 2 : ( "o"   U+006F Ll 1 "LATIN SMALL LETTER O" )
 3 : ( "e"   U+0065 Ll 1 "LATIN SMALL LETTER E" )
 4 : ( "Ìˆ"    U+0308 Mn 0 "COMBINING DIAERESIS" )
 5 : ( "l"   U+006C Ll 1 "LATIN SMALL LETTER L" )
ooRexx> (textNFC == textNFD)=                                               -- 1
 1
ooRexx> (textNFC = textNFD)=                                                -- 1
 1
ooRexx> (" "textNFC == textNFD" ")=                                         -- 0 because strict
 0
ooRexx> (" "textNFC = textNFD" ")=                                          -- 1
 1
ooRexx> (" "textNFC = (textNFD"\u{NBSP}")~unescape)=                        -- 1
 1
ooRexx> (" "textNFC = (textNFD"\u{ZWSP}")~unescape)=                        -- 1
 1
ooRexx> ("-"textNFC = ("\u{OBLIQUE HYPHEN}"textNFD"\u{ZWSP}")~unescape)=    -- 1
 1


-- []
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"[3]=; result~description=
T'Ã«'
'UTF-8 not-ASCII (1 character, 1 codepoint, 2 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"[3,3]=; result~description=
T'Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (3 characters, 9 codepoints, 28 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"[3,6]=; result~description=
T'Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
'UTF-8 not-ASCII (4 characters, 10 codepoints, 32 bytes, 0 error)'


-- ?
ooRexx> "0"~?("true", "false")=
'false'
ooRexx> "1"~?("true", "false")=
'true'
ooRexx> "not a boolean value"~?("true", "false")=
Logical value must be exactly "0" or "1"; found "not a boolean value".
Error code= 34.901
ooRexx> "not a boolean value ðŸ¤”"~?("true", "false")=
UTF-8 not-ASCII 'not a b...' is not compatible with a Rexx logical value.
Error code= 23.900
ooRexx> "0"~?("true ðŸ¤”", "false ðŸ¤”")=
T'false ðŸ¤”'
ooRexx> "1"~?("true ðŸ¤”", "false ðŸ¤”")=
T'true ðŸ¤”'


-- append
ooRexx> "hello"~append(" ")~append("john")=
'hello john'
ooRexx> "\uD83D"~text("wtf8")~append("\uDE3F")~unescape=    -- High surrogate followed by low surrogate is valid WTF-8
T'ðŸ˜¿'
ooRexx> "\uD83D"~text("utf8")~append("\uDE3F")~unescape=    -- High surrogate followed by low surrogate is INVALID UTF-8
T'í ½í¸¿'
ooRexx> -- Something to rework: the String BIF/BIM lose the encoding
-- Must use ~text to have the right encoding after concatenation of WTF-8 with UTF-8
-- See diary on 2022 August 03: The ~unescape will manage correctly this concatenation when WTF-8
-- Using ~~setEncoding("wtf8") instead of ~text("wtf8") doesn't work because the encoding is lost:
ooRexx> "\uD83D"~text("wtf8")~append("\uDE3F")=; result~description=            -- T'\uD83D\uDE3F'  'WTF-8 ASCII (12 characters, 12 codepoints, 12 bytes, 0 error)'
T'\uD83D\uDE3F'
'WTF-8 ASCII (12 characters, 12 codepoints, 12 bytes, 0 error)'
ooRexx> "\uD83D"~text("wtf8")~append("\uDE3F")~unescape~c2x=                    -- 'F09F98BF'   good!
'F09F98BF'
ooRexx> "\uD83D"~~setEncoding("wtf8")~append("\uDE3F")=; result~description=    -- '\uD83D\uDE3F'   'UTF-8 ASCII by default (12 bytes)'
'\uD83D\uDE3F'
'UTF-8 ASCII by default (12 bytes)'
ooRexx> "\uD83D"~~setEncoding("wtf8")~append("\uDE3F")~unescape~c2x=            -- 'ED A0 BD ED B8 BF'  not good!
'ED A0 BD ED B8 BF'


-- c2d
ooRexx> "e"~c2d=
 101
ooRexx> "Ã©"~c2d=
 50089


-- c2x
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~c2x=
'6E 6F C3AB 6C F09F91A9 E2808D F09F91A8 E2808D F09F91A9 E2808D F09F91A7 F09F8E85'


/*
A caseless method is transforming its arguments using CaseFold.
The default normalization is NFC, it's possible to change it with the argument
normalization
    .unicode~NFC    (default)
    .unicode~NFD
    .unicode~NFKC
    .unicode~NFKD
There is no value NFKC_CF because it can be done using the caseless methods by
passing NFKC + stripIgnorable.
*/


-- caselessCompare
-- casefold 2 characters: "ÃŸ" becomes "ss"
ooRexx> "BundesstraÃŸe im Freiland"~caselessCompare("BundesstraÃŸe")=        -- 14
 14
ooRexx> "BundesstraÃŸe im Freiland"~caselessCompare("BundesstraÃŸe", "_")=   -- 13
 13
ooRexx> "BundesstraÃŸe im Freiland"~caselessCompare("bundesstrasse")=       -- 14
 14
ooRexx> "Bundesstrasse im Freiland"~caselessCompare("bundesstraÃŸe")=       -- 15
 15
ooRexx> "straÃŸssÃŸÃŸssse"~compare("stra", "ÃŸ")=                              --  6
 6
ooRexx> "straÃŸssÃŸÃŸssse"~caselessCompare("stra", "ÃŸ")=                      -- 12 (not 13 because the last 's' matches only half of the casefolded pad "ÃŸ" which is "ss")
 12


-- caselessCompareTo
ooRexx> "pere noel"~caselessCompareTo("PÃ¨re NoÃ«l")=                    -- -1 (lesser)
-1
ooRexx> "pere noel"~caselessCompareTo("PÃ¨re NoÃ«l", stripMark:.true)=   --  0 (equal because the accents are ignored)
 0


-- caselessEndsWith
ooRexx> "hello"~caselessEndsWith("")=                  -- false
 0
ooRexx> "hello"~caselessEndsWith("O")=                 -- true
 1
ooRexx> "hello"~caselessEndsWith("Ã”")=                 -- false
 0
ooRexx> "hello"~caselessEndsWith("Ã”", stripMark:)=     -- true
 1
"noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessEndsWith("ðŸŽ…")=                -- true
 1
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessEndsWith("ðŸ‘§ðŸŽ…")=              -- false (not aligned with a grapheme)
 0
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessEndsWith("â€ðŸ‘§ðŸŽ…")=             -- false (not aligned with a grapheme)
 0
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessEndsWith("ðŸ‘©â€ðŸ‘§ðŸŽ…")=           -- false (not aligned with a grapheme)
 0
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessEndsWith("Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…")=   -- true
 1
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessEndsWith("Ã‹LðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…")=   -- true
 1


-- caselessEquals
ooRexx> "Å’UF"~caselessEquals("Å“uf")=           -- 1
 1
ooRexx> "Å“uf"~caselessEquals("Å’UF")=           -- 1
 1
ooRexx> "StraÃŸe"~caselessEquals("strasse")=    -- 1
 1
ooRexx> "strasse"~caselessEquals("StraÃŸe")=    -- 1
 1

-- caselessEquals (cont.) strict versus non-strict
ooRexx> string1 = "LE\u{IDEOGRAPHIC SPACE}PÃˆ\u{ZERO-WIDTH-SPACE}RE\u{HYPHEN}NOÃ‹L"~unescape
ooRexx> string2 = "Le\u{OGHAM SPACE MARK}PÃ¨re\u{EN DASH}No\u{ZERO-WIDTH-SPACE}Ã«l"~unescape
ooRexx> string1=                                                -- T'LEã€€PÃˆâ€‹REâ€NOÃ‹L
T'LEã€€PÃˆâ€‹REâ€NOÃ‹L'
ooRexx> string2=                                                -- T'Leáš€PÃ¨reâ€“Noâ€‹Ã«l'
T'Leáš€PÃ¨reâ€“Noâ€‹Ã«l'
ooRexx> string1~c2x=                                            -- '4C 45 E38080 50 C388 E2808B 52 45 E28090 4E 4F C38B 4C'
'4C 45 E38080 50 C388 E2808B 52 45 E28090 4E 4F C38B 4C'
ooRexx> string2~c2x=                                            -- '4C 65 E19A80 50 C3A8 72 65 E28093 4E 6F E2808B C3AB 6C'
'4C 65 E19A80 50 C3A8 72 65 E28093 4E 6F E2808B C3AB 6C'
ooRexx> string1~caselessEquals(string2)=                        -- false (strict mode by default)
 0

-- The non-strict mode applies these transformations:
ooRexx> string1~nfkd(casefold:, lump:, stripIgnorable:)~c2x=    -- '6C 65 20 70 65 CC80 72 65 2D 6E 6F 65 CC88 6C'
'6C 65 20 70 65 CC80 72 65 2D 6E 6F 65 CC88 6C'
ooRexx> string2~nfkd(casefold:, lump:, stripIgnorable:)~c2x=    -- '6C 65 20 70 65 CC80 72 65 2D 6E 6F 65 CC88 6C'
'6C 65 20 70 65 CC80 72 65 2D 6E 6F 65 CC88 6C'
ooRexx> string1~caselessEquals(string2, strict:.false)=         -- true (non-strict mode)
 1


-- caselessMatch
-- "BundesschnellstraÃŸe"                                    -- at 14: "s", at 18:"ÃŸ"
--  1234567890123456789
ooRexx> "BundesstraÃŸe im Freiland"~caselessMatch(14, "im")=    -- .true
 1


-- caselessMatchChar
-- "BundesschnellstraÃŸe"                               -- at 14: "s", at 18:"ÃŸ"
--  1234567890123456789
ooRexx> "BundesschnellstraÃŸe"~caselessMatchChar(18, "s")=      -- 0    "ÃŸ" becomes "ss" which is 2 characters. "s" doesn't match "ss".
 0
ooRexx> "BundesschnellstraÃŸe"~caselessMatchChar(19, "s")=      -- 0    "ÃŸ" becomes "ss" which is 2 characters. The character at 19 is "e", not the second "s"
 0
ooRexx> "BundesschnellstraÃŸe"~caselessMatchChar(19, "e")=      -- 1    "ÃŸ" becomes "ss" which is 2 characters. The character at 19 is "e", not the second "s"
 1

-- caselessMatchChar (cont.)
-- The ligature disappears when casefolded
ooRexx> "baï¬„e"~casefold=                                        -- T'baffle'
T'baffle'
ooRexx> "BAFFLE"~caselessMatchChar(3, "ï¬„")=                     -- 0   The 3rd character "F" casefolded "f" doesn't match ""ï¬„"" casefolded "ffl"
 0
ooRexx> "BAFFLE"~caselessMatchChar(5, "ï¬„")=                     -- 0   The 5th character "L" casefolded "l" doesn't match ""ï¬„"" casefolded "ffl"
 0
ooRexx> "BAFFLE"~caselessMatchChar(5, "L")=                      -- 1   There is a match on "l" at 5
 1

-- caselessMatchChar (cont.)
-- Some ligatures are not decomposed by NFKC.
ooRexx> "Å’UF"~caselessEquals("oeuf")=                                  -- 0
 0
ooRexx> "Å’UF"~caselessEquals("oeuf", normalization:.Unicode~NFKC)=     -- 0
 0


-- caselessPos
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~caselessPos("OÃ‹")=                   -- 7
 7
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~caselessPos("OÃ‹", 8)=                -- 17
 17
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~caselessPos("OÃ‹", 8, 10)=            -- 0
 0
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~caselessPos("OE")=                   -- 0
 0
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~caselessPos("OE", stripMark:)=       -- 7
 7
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessPos("ðŸŽ…")=                  -- 6
 6
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessPos("ðŸ‘§ðŸŽ…")=               -- 0
 0

-- caselessPos in not-aligned mode
/*
aligned=.false is intended for analysis of matchings and [non-]regression tests.
Otherwise, I don't see any use.

If aligned=.false then return a couple (array) of numbers +/-posC.posB where
posB is the position of the matched byte in the transformed haystack, and posC
is the corresponding grapheme position in the untransformed haystack.
A number is negative if the byte position is not aligned with the corresponding
character position.
The first number is the start of the matching.
The second number is the end of the matching + 1.
*/
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessPos("ðŸ‘§ðŸŽ…", aligned:.false)=   -- [-5.27,+7.35]
[-5.27,+7.35]
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~caselessPos("ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…", aligned:.false)=   -- [+5.6,+7.35]
[+5.6,+7.35]


-- center
ooRexx> "noelFC"~center(10)=; result~description=              -- forward to String
'  noelFC  '
'UTF-8 ASCII by default (10 bytes)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(10)=; result~description=
T'  noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…  '
'UTF-8 not-ASCII (10 characters, 16 codepoints, 38 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(9)=; result~description=
T' noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…  '
'UTF-8 not-ASCII (9 characters, 15 codepoints, 37 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(8)=; result~description=
T' noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ… '
'UTF-8 not-ASCII (8 characters, 14 codepoints, 36 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(7)=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ… '
'UTF-8 not-ASCII (7 characters, 13 codepoints, 35 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(6)=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
'UTF-8 not-ASCII (6 characters, 12 codepoints, 34 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(5)=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (5 characters, 11 codepoints, 30 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(4)=; result~description=
T'oÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (4 characters, 10 codepoints, 29 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(3)=; result~description=
T'oÃ«l'
'UTF-8 not-ASCII (3 characters, 3 codepoints, 4 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(2)=; result~description=
T'Ã«l'
'UTF-8 not-ASCII (2 characters, 2 codepoints, 3 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(1)=; result~description=
T'Ã«'
'UTF-8 not-ASCII (1 character, 1 codepoint, 2 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(0)=; result~description=
T''
'UTF-8 ASCII (0 character, 0 codepoint, 0 byte, 0 error)'

-- center with pad
ooRexx> "="~description=                                            -- 'UTF-8 ASCII (1 byte)'
'UTF-8 ASCII (1 byte)'
ooRexx> "="~c2x=                                                    -- '3D'
'3D'
ooRexx> "noelFC"~center(10, "=")=; result~description=              -- forward to String
'==noelFC=='
'UTF-8 ASCII by default (10 bytes)'
ooRexx> "â•"~description=                                            -- 'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'   (was 'UTF-8 not-ASCII (3 bytes)')
'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
ooRexx> "â•"~description=                                            -- 'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
ooRexx> "â•"~c2x=                                                    -- 'E29590'
'E29590'
ooRexx> "noelFC"~center(10, "â•")=; result~description=              -- don't forward to String because the pad is more than 1 byte
T'â•â•noelFCâ•â•'
'UTF-8 not-ASCII (10 characters, 10 codepoints, 18 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(10, "â•")=; result~description=
T'â•â•noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â•â•'
'UTF-8 not-ASCII (10 characters, 16 codepoints, 46 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(9, "â•")=; result~description=
T'â•noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â•â•'
'UTF-8 not-ASCII (9 characters, 15 codepoints, 43 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(8, "â•")=; result~description=
T'â•noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â•'
'UTF-8 not-ASCII (8 characters, 14 codepoints, 40 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(7, "â•")=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â•'
'UTF-8 not-ASCII (7 characters, 13 codepoints, 37 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~center(6, "â•")=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
'UTF-8 not-ASCII (6 characters, 12 codepoints, 34 bytes, 0 error)'


-- compare
ooRexx> "BundesstraÃŸe im Freiland"~compare("BundesstraÃŸe")=        -- 14
 14
ooRexx> "BundesstraÃŸe im Freiland"~compare("BundesstraÃŸe", "_")=   -- 13
 13
ooRexx> "BundesstraÃŸe im Freiland"~compare("Bundesstrasse")=       -- 11
 11
ooRexx> "Bundesstrasse im Freiland"~compare("BundesstraÃŸe")=       -- 11
 11
ooRexx> "straÃŸssÃŸÃŸssse"~compare("stra", "ÃŸ")=                      --  6
 6


-- compareTo
ooRexx> "pere noel"~compareTo("pÃ¨re noÃ«l")=                    -- -1 (lesser)
-1
ooRexx> "pere noel"~compareTo("pÃ¨re noÃ«l", stripMark:.true)=   --  0 (equal because the accents are ignored)
 0


-- contains
ooRexx> "noel"~contains("oe")=            -- forward to String
 1
ooRexx> "noel"~contains("oe")=            -- forward to String
 1
ooRexx> "noel"~contains("oÃ«")=
 0
ooRexx> "noel"~contains("oÃ«")=
 0
ooRexx> "noÃ«l"~contains("oe")=
 0
ooRexx> "noÃ«l"~contains("oe")=
 0
ooRexx> "noÃ«l"~contains("oÃ«")=
 1
ooRexx> "noÃ«l"~contains("oÃ«")=
 1


-- copies
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~copies(4)=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
'UTF-8 not-ASCII (24 characters, 48 codepoints, 136 bytes, 0 error)'


-- endsWith
ooRexx> "hello"~endsWith("")=                  -- false
 0
ooRexx> "hello"~endsWith("o")=                 -- true
 1
ooRexx> "hello"~endsWith("Ã´")=                 -- false
 0
ooRexx> "hello"~endsWith("Ã´", stripMark:)=     -- true
 1
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~endsWith("ðŸŽ…")=                -- true
 1
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~endsWith("ðŸ‘§ðŸŽ…")=              -- false (not aligned with a grapheme)
 0
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~endsWith("â€ðŸ‘§ðŸŽ…")=             -- false (not aligned with a grapheme)
 0
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~endsWith("ðŸ‘©â€ðŸ‘§ðŸŽ…")=           -- false (not aligned with a grapheme)
 0
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~endsWith("Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…")=   -- true
 1
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~endsWith("Ã‹LðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…")=   -- false
 0


-- equals
ooRexx> "Å’UF"~lower~equals("Å“uf")=             -- true
 1
ooRexx> "Å’UF"~equals("Å“uf")=                   -- false (would be true if caseless)
 0
ooRexx> "Å“uf"~equals("Å’UF")=                   -- false (would be true if caseless)
 0
ooRexx> "StraÃŸe"~lower~equals("straÃŸe")=       -- true (U+00DF "LATIN SMALL LETTER SHARP S" remains unchanged since it's already a lower letter)
 1
ooRexx> "StraÃŸe"~casefold~equals("strasse")=   -- true (U+00DF "LATIN SMALL LETTER SHARP S" becomes "ss" when casefolded)
 1
ooRexx> "StraÃŸe"~equals("strasse")=            -- false (would be true if caseless)
 0
ooRexx> "strasse"~equals("StraÃŸe")=            -- false (would be true if caseless)
 0

-- equals (cont.) strict versus non-strict
ooRexx> string1 = "Le\u{IDEOGRAPHIC SPACE}PÃ¨\u{ZERO-WIDTH-SPACE}re\u{HYPHEN}NoÃ«l"~unescape
ooRexx> string2 = "Le\u{OGHAM SPACE MARK}PÃ¨re\u{EN DASH}No\u{ZERO-WIDTH-SPACE}Ã«l"~unescape
ooRexx> string1=                                    -- T'Leã€€PÃ¨â€‹reâ€NoÃ«l'
T'Leã€€PÃ¨â€‹reâ€NoÃ«l'
ooRexx> string2=                                    -- T'Leáš€PÃ¨reâ€“Noâ€‹Ã«l'
T'Leáš€PÃ¨reâ€“Noâ€‹Ã«l'
ooRexx> string1~c2x=                                -- '4C 65 E38080 50 C3A8 E2808B 72 65 E28090 4E 6F C3AB 6C'
'4C 65 E38080 50 C3A8 E2808B 72 65 E28090 4E 6F C3AB 6C'
ooRexx> string2~c2x=                                -- '4C 65 E19A80 50 C3A8 72 65 E28093 4E 6F E2808B C3AB 6C'
'4C 65 E19A80 50 C3A8 72 65 E28093 4E 6F E2808B C3AB 6C'
ooRexx> string1~equals(string2)=                    -- false (strict mode by default)
 0
ooRexx> -- The non-strict mode applies these transformations:
ooRexx> string1~nfkd(lump:, stripIgnorable:)~c2x=   -- '4C 65 20 50 65 CC80 72 65 2D 4E 6F 65 CC88 6C'
'4C 65 20 50 65 CC80 72 65 2D 4E 6F 65 CC88 6C'
ooRexx> string2~nfkd(lump:, stripIgnorable:)~c2x=   -- '4C 65 20 50 65 CC80 72 65 2D 4E 6F 65 CC88 6C'
'4C 65 20 50 65 CC80 72 65 2D 4E 6F 65 CC88 6C'
ooRexx> string1~equals(string2, strict:.false)=     -- true (non-strict mode)
 1


-- hashCode
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~hashCode~class=
(The String class)
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~hashCode~c2x=
'8FA5DCDA35AE1A58'


-- left
ooRexx> do i=0 to 9; "left("i") = " || "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~left(i)=; end
T'left(0) = '
T'left(1) = n'
T'left(2) = no'
T'left(3) = noÃ«'
T'left(4) = noÃ«l'
T'left(5) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
T'left(6) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'left(7) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ… '
T'left(8) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…  '
T'left(9) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…   '
ooRexx> do i=0 to 9; "left("i", â–·) = " || "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~left(i, "â–·")=; end
T'left(0, â–·) = '
T'left(1, â–·) = n'
T'left(2, â–·) = no'
T'left(3, â–·) = noÃ«'
T'left(4, â–·) = noÃ«l'
T'left(5, â–·) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
T'left(6, â–·) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'left(7, â–·) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â–·'
T'left(8, â–·) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â–·â–·'
T'left(9, â–·) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â–·â–·â–·'


-- length
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~length=
 6


-- lower
ooRexx> "LE PÃˆRE NOÃ‹L EST FATIGUÃ‰..."~lower=       -- T'le pÃ¨re noÃ«l est fatiguÃ©...'
T'le pÃ¨re noÃ«l est fatiguÃ©...'


-- match
ooRexx> "noel"~match(2, "oe")=            -- forward to String
 1
ooRexx> "noel"~match(2, "oe")=            -- forward to String
 1
ooRexx> "noel"~match(2, "oÃ«")=
 0
ooRexx> "noel"~match(2, "oÃ«")=
 0
ooRexx> "noÃ«l"~match(2, "oe")=
 0
ooRexx> "noÃ«l"~match(2, "oe")=
 0
ooRexx> "noÃ«l"~match(2, "oÃ«")=
 1
ooRexx> "noÃ«l"~match(2, "oÃ«")=
 1
ooRexx> "noÃ«l"~match(2, "oÃ«l")=
 1
ooRexx> "noÃ«l"~match(2, "oÃ«l")=
 1
ooRexx> "noÃ«l"~match(3, "Ã«")=
 1
ooRexx> "noÃ«l"~match(3, "Ã«")=
 1
ooRexx> "noÃ«l"~match(3, "Ã«l")=
 1
ooRexx> "noÃ«l"~match(3, "Ã«l")=
 1
ooRexx> "noÃ«l"~match(4, "l")=
 1
ooRexx> "noÃ«l"~match(4, "l")=
 1


-- matchChar
ooRexx> "noel"~matchChar(3, "Ee")=        -- forward to String
 1
ooRexx> "noel"~matchChar(3, "Ee")=        -- forward to String
 1
ooRexx> "noel"~matchChar(3, "EÃ‹eÃ«")=
 1
ooRexx> "noel"~matchChar(3, "EÃ‹eÃ«")=
 1
ooRexx> "noÃ«l"~matchChar(3, "EÃ‹eÃ«")=
 1
ooRexx> "noÃ«l"~matchChar(3, "EÃ‹eÃ«")=
 1
ooRexx> "noÃ«l"~matchChar(3, "EÃ‹eÃ«")=
 1
ooRexx> "noÃ«l"~matchChar(3, "Ee", stripMark:)= -- remove the accents from the tested string
 1
ooRexx> "noÃ«l"~matchChar(4, "Ll")=
 1
ooRexx> "noÃ«l"~matchChar(4, "Ll")=
 1

-- matchChar (cont.)
-- "BundesschnellstraÃŸe"                               -- at 14: "s", at 18:"ÃŸ"
--  1234567890123456789
ooRexx> "BundesschnellstraÃŸe"~matchChar(14, "s")=              -- 1
 1
ooRexx> "BundesschnellstraÃŸe"~matchChar(18, "s")=              -- 0
 0
ooRexx> "BundesschnellstraÃŸe"~matchChar(18, "ÃŸ")=              -- 1
 1

-- matchChar (cont.)
-- The ligature disappears in NFK[CD] but not in NF[CD]
ooRexx> "baï¬„e"~matchChar(3, "f")=                               -- 0     "ï¬„" is ONE character, doesn't match "f"
 0
ooRexx> "baï¬„e"~matchChar(3, "ï¬„")=                              -- 1     There is a match because "ï¬„" on both sides
 1
ooRexx> "baï¬„e"~matchChar(3, "ï¬„", normalization:.Unicode~NFKD)= -- 1     There is a match because "ï¬„" on both sides
 1
ooRexx> "baï¬„e"~matchChar(3, "f", normalization:.Unicode~NFKD)=  -- 0     The 3rd character "ï¬„" becomes "ffl" (3 characters), doesn't match "f"
 0
ooRexx> "baï¬„e"~matchChar(4, "f", normalization:.Unicode~NFKD)=  -- 0     The 4th character is "e", doesn't match "f"
 0
ooRexx> "baï¬„e"~matchChar(4, "e", normalization:.Unicode~NFKD)=  -- 1     The 4th character is "e", does match "e"
 1


-- pos
ooRexx> "noel"~pos("oe")=                 -- forward to String
 2
ooRexx> "noel"~pos("oe")=                 -- forward to String
 2
ooRexx> "noel"~pos("oÃ«")=
 0
ooRexx> "noel"~pos("oÃ«")=
 0
ooRexx> "noÃ«l"~pos("oe")=
 0
ooRexx> "noÃ«l"~pos("oe")=
 0
ooRexx> "noÃ«l"~pos("oÃ«")=
 2
ooRexx> "noÃ«l"~pos("oÃ«")=
 2
ooRexx> "noÃ«l"~pos("l")=
 4
ooRexx> "noÃ«l"~pos("l")=
 4
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~pos("oÃ«")=                        -- 7
 7
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~pos("oÃ«", 8)=                     -- 17
 17
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~pos("oÃ«", 8, 10)=                 -- 0
 0
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~pos("oe")=                        -- 0
 0
ooRexx> "PÃ¨re NoÃ«l PÃ¨re NoÃ«l"~pos("oe", stripMark:)=            -- 7
 7
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~pos("ðŸŽ…")=                      -- 6
 6
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~pos("ðŸ‘§ðŸŽ…")=                    -- 0
 0
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~pos("ðŸ‘§ðŸŽ…", aligned:.false)=    -- [-5.27,+7.35]
[-5.27,+7.35]
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~pos("ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…", aligned:.false)=   -- [+5.6,+7.35]
[+5.6,+7.35]


-- reverse (correct)
ooRexx> "noÃ«l"~c2x=            -- '6E 6F C3AB 6C'
'6E 6F C3AB 6C'
ooRexx> "noÃ«l"~reverse~c2x=    -- '6C C3AB 6F 6E'
'6C C3AB 6F 6E'
ooRexx> "noÃ«l"~reverse=        -- T'lÃ«on'
T'lÃ«on'

-- reverse (correct)    (was reverse (wrong) before automatic conversion of string literals to text)
ooRexx> "noÃ«l"~c2x=             -- '6E6FC3AB6C'
'6E 6F C3AB 6C'
ooRexx> "noÃ«l"~reverse~c2x=     -- '6C C3AB 6F 6E'  (was '6CABC36F6E' before automatic conversion of string literals to text)
'6C C3AB 6F 6E'
ooRexx> "noÃ«l"~reverse=         -- T'lÃ«on'
T'lÃ«on'


-- right
ooRexx> do i=0 to 9; "right("i") = " || "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~right(i)=; end
T'right(0) = '
T'right(1) = ðŸŽ…'
T'right(2) = ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(3) = lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(4) = Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(5) = oÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(6) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(7) =  noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(8) =   noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(9) =    noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
ooRexx> do i=0 to 9; "right("i", â–·) = " || "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~right(i, "â–·")=; end
T'right(0, â–·) = '
T'right(1, â–·) = ðŸŽ…'
T'right(2, â–·) = ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(3, â–·) = lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(4, â–·) = Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(5, â–·) = oÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(6, â–·) = noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(7, â–·) = â–·noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(8, â–·) = â–·â–·noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
T'right(9, â–·) = â–·â–·â–·noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'


-- subchar
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~subchar(3)=; result~description=
T'Ã«'
'UTF-8 not-ASCII (1 character, 1 codepoint, 2 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~subchar(4)=; result~description=
T'l'
'UTF-8 ASCII (1 character, 1 codepoint, 1 byte, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~subchar(5)=; result~description=
T'ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (1 character, 7 codepoints, 25 bytes, 0 error)'


-- substr
ooRexx> "noel"~substr(3, 3, "x")=; result~description=   -- forward to String
'elx'
'UTF-8 ASCII by default (3 bytes)'
ooRexx> "noel"~substr(3, 3, "â–·")=; result~description=   -- T'elâ–·' (was: self is a String: error because the pad character is 3 bytes)
T'elâ–·'
'UTF-8 not-ASCII (3 characters, 3 codepoints, 5 bytes, 0 error)'
ooRexx> "noel"~substr(3, 3, "â–·")=; result~description=   -- T'elâ–·' (was: self is a String: error because the pad character is 3 bytes)
T'elâ–·'
'UTF-8 not-ASCII (3 characters, 3 codepoints, 5 bytes, 0 error)'
ooRexx> "noel"~substr(3, 3, "â–·")=; result~description=   -- no error because self is a RexxText and the pad character is one character when converted to the default encoding
T'elâ–·'
'UTF-8 not-ASCII (3 characters, 3 codepoints, 5 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~substr(3, 3, "â–·")=; result~description=
T'Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (3 characters, 9 codepoints, 28 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~substr(3, 6, "â–·")=; result~description=
T'Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â–·â–·'
'UTF-8 not-ASCII (6 characters, 12 codepoints, 38 bytes, 0 error)'


-- upper
ooRexx> "Le pÃ¨re NoÃ«l est fatiguÃ©..."~upper=       -- T'LE PÃˆRE NOÃ‹L EST FATIGUÃ‰...'
T'LE PÃˆRE NOÃ‹L EST FATIGUÃ‰...'




-- x2c
ooRexx> "F09F9180"~x2c=
'ðŸ‘€'
ooRexx> "not an hexadecimal value"~x2c
Only 0-9, a-f, A-F, and whitespace characters are valid in a hexadecimal string; character found "n".
Error code= 93.933
ooRexx> "not an hexadecimal value ðŸ¤”"~x2c
UTF-8 not-ASCII 'not an ...' is not compatible with a Rexx hexadecimal value.
Error code= 23.900


---------------------------------------------------------
-- Text encoding - Functional
---------------------------------------------------------

/*
The only needed methods on RexxText are
    ~characters
    ~subwords   (still to implement)
    ~chunks     (still to implement)
*/

/*
Example inspired by https://elixir-lang.org/
Frequency of each character, ignoring the accents:
"Elixir" |> String.graphemes() |> Enum.frequencies()
%{"E" => 1, "i" => 2, "l" => 1, "r" => 1, "x" => 1}
*/

ooRexx> "Notre pÃ¨re NoÃ«l ðŸŽ…"~transform(stripMark:)~reduce(by: "characters", initial: .stem~new~~put(0)){accu[item~string] += 1}=
a Stem (9 items)
'ðŸŽ…' :  1
' '    :  3
'e'    :  4
'l'    :  1
'N'    :  2
'o'    :  2
'p'    :  1
'r'    :  2
't'    :  1


---------------------------------------------------------
-- Text encoding - Generator
---------------------------------------------------------

/*
The only needed methods on RexxText are
    ~characters
    ~subwords   (still to implement)
*/

ooRexx> g="NoÃ«l ðŸŽ…"~generateC
ooRexx> g~()=       -- T'N'
T'N'
ooRexx> g~()=       -- T'o'
T'o'
ooRexx> g~()=       -- T'Ã«'
T'Ã«'
ooRexx> g~()=       -- T'l'
T'l'
ooRexx> g~()=       -- T' '
T' '
ooRexx> g~()=       -- T'ðŸŽ…'
T'ðŸŽ…'
ooRexx> g~()=       -- [no result]
[no result]


---------------------------------------------------------
-- Text encoding - Compatibility with regular expressions
---------------------------------------------------------

/*
A way to test the compatibility of RexxText with String is to pass instances of
RexxText to the regular expression engine regex.cls, and see what happens...
*/

/*
Relax the constraint "self~isCompatibleWithByteString" when converting a RexxText
to a String. That allows to go further in the tests of regular expression.
*/
ooRexx> unckeckedConversionToString = .Unicode~unckeckedConversionToString -- backup
ooRexx> .Unicode~unckeckedConversionToString = .true

ooRexx> pB = .Pattern~compile("a.c")
ooRexx> pT = .Pattern~compile("a.c")
ooRexx> pB~matches("abc")=                              -- 1
 1
ooRexx> pT~matches("abc")=                              -- 1
 1
ooRexx> pB~matches("aÃ´c")=                              -- 1    (was 0 (KO) before automatic conversion of string literals to text)
 1
ooRexx> pT~matches("aÃ´c")=                              -- 1
 1
ooRexx> pB~matches("aðŸŽ…c")=                             -- 1    (was 0 (KO) before automatic conversion of string literals to text)
 1
ooRexx> pT~matches("aðŸŽ…c")=                             -- 1
 1

ooRexx> pB = .Pattern~compile("ðŸ¤¶...ðŸŽ…")
ooRexx> pT = .Pattern~compile("ðŸ¤¶...ðŸŽ…")
ooRexx> pB~matches("ðŸ¤¶123ðŸŽ…")=                          -- 1
 1
ooRexx> pT~matches("ðŸ¤¶123ðŸŽ…")=                          -- 1
 1
ooRexx> pB~matches("ðŸ¤¶ðŸ•2ðŸˆðŸŽ…")=                        -- 1    (was 0 (KO) before automatic conversion of string literals to text)
 1
ooRexx> pT~matches("ðŸ¤¶ðŸ•2ðŸˆðŸŽ…")=                        -- 1
 1
ooRexx> pB~matches("ðŸ¤¶ðŸ•ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸˆðŸŽ…")=          -- 1    (was 0 (KO) before automatic conversion of string literals to text)
 1
ooRexx> pT~matches("ðŸ¤¶ðŸ•ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸˆðŸŽ…")=          -- 1
 1

-- "ðŸ¤¶" or "ðŸŽ…"
ooRexx> pB = .Pattern~compile("ðŸ¤¶|ðŸŽ…")
ooRexx> pT = .Pattern~compile("ðŸ¤¶|ðŸŽ…")
ooRexx> pB~startsWith("ðŸ¤¶ðŸŽ…c")=                        -- 1
 1
ooRexx> pT~startsWith("ðŸ¤¶ðŸŽ…c")=                        -- 1
 1
ooRexx> pB~startsWith("ðŸŽ…ðŸ¤¶c")=                        -- 1
 1
ooRexx> pT~startsWith("ðŸŽ…ðŸ¤¶c")=                        -- 1
 1
ooRexx> r = pB~find("xxxðŸ¤¶ðŸŽ…cxxx")
ooRexx> r~matched=; r~start=; r~end=; r=; r~length=     -- now ok (r~end was 8 and r~length was 4 before automatic conversion of string literals to text)
 1
 4
 5
(a MatchResult)
 1
ooRexx> r = pT~find("xxxðŸ¤¶ðŸŽ…cxxx")
ooRexx> r~matched=; r~start=; r~end=; r=; r~length=
 1
 4
 5
(a MatchResult)
 1
ooRexx> r = pB~find("xxxðŸŽ…ðŸ¤¶cxxx")
ooRexx> r~matched=; r~start=; r~end=; r=; r~length=     -- now ok (r~end was 8 and r~length was 4 before automatic conversion of string literals to text)
 1
 4
 5
(a MatchResult)
 1
ooRexx> r = pT~find("xxxðŸŽ…ðŸ¤¶cxxx")
ooRexx> r~matched=; r~start=; r~end=; r=; r~length=
 1
 4
 5
(a MatchResult)
 1

ooRexx> .Unicode~unckeckedConversionToString = unckeckedConversionToString -- restore


-----------------------------------------
-- Text encoding - Compatibility with BIF
-----------------------------------------

/*
The string BIFs are polymorphic on RexxString/RexxText.
If at least one positional argument is a RexxText then the BIF forwards to
RexxText, otherwise the BIF forwards to RexxString.
*/

-- Function 'center'
ooRexx> "â•"~description=                                -- 'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'   (was 'UTF-8 not-ASCII (3 bytes)')
'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
ooRexx> "â•"~description=                                -- 'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
ooRexx> "â•"~c2x=                                        -- 'E29590'
'E29590'
ooRexx> center("hello", 20, "â•")=                       -- T'â•â•â•â•â•â•â•helloâ•â•â•â•â•â•â•â•'
T'â•â•â•â•â•â•â•helloâ•â•â•â•â•â•â•â•'
ooRexx> center("hello", 20, "â•")~description=           -- 'UTF-8 not-ASCII (20 characters, 20 codepoints, 50 bytes, 0 error)'
'UTF-8 not-ASCII (20 characters, 20 codepoints, 50 bytes, 0 error)'

-- Function 'left'
ooRexx> left("hello", 20, "â•")=                         -- T'helloâ•â•â•â•â•â•â•â•â•â•â•â•â•â•â•'
T'helloâ•â•â•â•â•â•â•â•â•â•â•â•â•â•â•'
ooRexx> left("hello", 20, "â•")~description=             -- 'UTF-8 not-ASCII (20 characters, 20 codepoints, 50 bytes, 0 error)'
'UTF-8 not-ASCII (20 characters, 20 codepoints, 50 bytes, 0 error)'


/*
[ABANDONNED]
Other polymorphism: route the BIF either towards String or towards RexxText,
in function of the compatibility of the arguments with String:
BIF(str1, str2, ..., strN)
    --> forward to String (byte-oriented) if str's encoding is Byte or UTF-8 (with ASCII characters only)
    --> forward to RexxText otherwise

Abandonned because we have already the polymorphism on RexxString/RexxText which
is more easy to control and to understand.
*/

-- UTF-8 encoding

ooRexx> "Noel"~isCompatibleWithByteString=              -- 1
 1
ooRexx> length("Noel")=                                 -- 4 because "Noel"~length = 4
 4
ooRexx> "NoÃ«l"~isCompatibleWithByteString=              -- 0
 0
ooRexx> length("NoÃ«l")=                                 -- 4 because "NoÃ«l" is a RexxText   (was TODO: 4 because "NoÃ«l"~text~length = 4)
 4
ooRexx> "NoÃ«l"~length=                                  -- 4 because "NoÃ«l" is a RexxText   (was "5 because String remains byte-oriented, not impacted by the default encoding" before automatic conversion of string literals to text)
 4

-- UTF-16BE encoding
ooRexx> s = "0041004200430044"x
ooRexx> s=                                              -- '[00]A[00]B[00]C[00]D'
'[00]A[00]B[00]C[00]D'
ooRexx> s~isCompatibleWithByteString=                   -- 1
 1
ooRexx> s~description=                                  -- 'UTF-8 ASCII (8 bytes)'
'UTF-8 ASCII (8 bytes)'
ooRexx> length(s)=                                      -- 8 because encoding UTF-8 ASCII is compatible with String
 8
ooRexx> s~encoding = "UTF16"
ooRexx> s~isCompatibleWithByteString=                   -- 0
 0
ooRexx> s~description=                                  -- 'UTF-16BE (8 bytes)'
'UTF-16BE (8 bytes)'
ooRexx> s~length=                                       -- 8 because String is always byte-oriented (ignores the encoding)
 8
ooRexx> length(s)=                                      -- 8    (was TODO: 4 because forwards to Text (encoding UTF-16BE is not compatible with String))
 8
ooRexx> s~utf8=                                         -- T'ABCD'
T'ABCD'

-- UTF-32 encoding
ooRexx> s = "0000004100000042"x
ooRexx> s=                                              -- '[000000]A[000000]B'
'[000000]A[000000]B'
ooRexx> s~isCompatibleWithByteString=                   -- 1
 1
ooRexx> s~description=                                  -- 'UTF-8 ASCII (8 bytes)'
'UTF-8 ASCII (8 bytes)'
ooRexx> length(s)=                                      -- 8 because encoding UTF-8 ASCII is compatible with String
 8
ooRexx> s~encoding = "UTF32"
ooRexx> s~isCompatibleWithByteString=                   -- 0
 0
ooRexx> s~description=                                  -- 'UTF-32BE (8 bytes)'
'UTF-32BE (8 bytes)'
ooRexx> s~length=                                       -- 8 because String is always byte-oriented (ignores the encoding)
 8
ooRexx> length(s)=                                      -- 8    (was TODO: 2 because forwards to Text (encoding UTF-32 is not compatible with String))
 8
ooRexx> s~utf8=                                         -- T'AB'
T'AB'


/*
End of demonstration.
*/
