
ooRexx> call loadUnicodeCharacterNames
Load the Unicode character names 15.0.0 
.............................................
Total loaded character names: 149186
Total character name aliases: 473
Unicode character intervals not expanded, execute: call expandUnicodeCharacterIntervals


--------------------------------------------
-- Text encoding - Compatibility with String
--------------------------------------------

/*
Compatibility with the class String.
This is a work in progress, many methods not yet supported,
Unicode implementation still missing for many methods.
*/

/*
This string is used in several places:
"noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"
Depending on your editor/browser, you may see 5 emojis, or 3 emojis.
With Unicode 13, the display is 3 emojis (woman + family + father christmas).
ðŸ‘©	U+1F469	WOMAN
â€	U+200D	ZERO WIDTH JOINER
ðŸ‘¨	U+1F468	MAN
â€	U+200D	ZERO WIDTH JOINER
ðŸ‘©	U+1F469	WOMAN
â€	U+200D	ZERO WIDTH JOINER
ðŸ‘§	U+1F467	GIRL
ðŸŽ…	U+1F385	FATHER CHRISTMAS

Notice that ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ constitute only 1 grapheme thanks to the ZERO WIDTH JOINER.
*/


ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~description=
'UTF-8 not-ASCII (6 characters, 12 codepoints, 34 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~c2u=
'U+006E U+006F U+00EB U+006C U+1F469 U+200D U+1F468 U+200D U+1F469 U+200D U+1F467 U+1F385'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~c2x=
'6E 6F C3AB 6C F09F91A9 E2808D F09F91A8 E2808D F09F91A9 E2808D F09F91A7 F09F8E85'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~c2g=
'6E 6F C3AB 6C F09F91A9E2808DF09F91A8E2808DF09F91A9E2808DF09F91A7 F09F8E85'


/*
Two RexxText values are considered equal if their extended grapheme clusters
are canonically equivalent.This is used by the Swift language.
Q&A: https://lists.isocpp.org/sg16/2018/08/0121.php

TODO: confirm that it's NFC, and only that.
The definition of canonical equivalence by the Unicode standard seems not
limited to NFC. https://unicode.org/notes/tn5/
*/

/*
The strict comparison operators use the NFC normalization.
After normalization, they delegate to the String's strict comparison operators.

The non-strict comparison operators use the NFC normalization plus
    stripIgnorable:.true
    lump:.true
After normalization + transformations, they delegate to the String's non-strict
comparison operators. Thanks to the lump transformation, all the Unicode spaces
are supported.
*/

ooRexx> textNFC = "NoÃ«l"~text~NFC
ooRexx> textNFC~UnicodeCharacters==
an Array (shape [4], 4 items)
 1 : ( "N"   U+004E Lu 1 "LATIN CAPITAL LETTER N" )
 2 : ( "o"   U+006F Ll 1 "LATIN SMALL LETTER O" )
 3 : ( "Ã«"   U+00EB Ll 1 "LATIN SMALL LETTER E WITH DIAERESIS" )
 4 : ( "l"   U+006C Ll 1 "LATIN SMALL LETTER L" )
ooRexx> textNFD="NoÃ«l"~text~NFD
ooRexx> textNFD~UnicodeCharacters==
an Array (shape [5], 5 items)
 1 : ( "N"   U+004E Lu 1 "LATIN CAPITAL LETTER N" )
 2 : ( "o"   U+006F Ll 1 "LATIN SMALL LETTER O" )
 3 : ( "e"   U+0065 Ll 1 "LATIN SMALL LETTER E" )
 4 : ( "Ìˆ"    U+0308 Mn 0 "COMBINING DIAERESIS" )
 5 : ( "l"   U+006C Ll 1 "LATIN SMALL LETTER L" )
ooRexx> (textNFC == textNFD)=                                               -- 1
 1
ooRexx> (textNFC = textNFD)=                                                -- 1
 1
ooRexx> (" "textNFC == textNFD" ")=                                         -- 0 because strict
 0
ooRexx> (" "textNFC = textNFD" ")=                                          -- 1
 1
ooRexx> (" "textNFC = (textNFD"\u{NBSP}")~unescape)=                        -- 1
 1
ooRexx> (" "textNFC = (textNFD"\u{ZWSP}")~unescape)=                        -- 1
 1
ooRexx> ("-"textNFC = ("\u{OBLIQUE HYPHEN}"textNFD"\u{ZWSP}")~unescape)=    -- 1
 1


-- []
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text[3]=; result~description=
T'Ã«'
'UTF-8 not-ASCII (1 character, 1 codepoint, 2 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text[3,3]=; result~description=
T'Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (3 characters, 9 codepoints, 28 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text[3,6]=; result~description=
T'Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
'UTF-8 not-ASCII (4 characters, 10 codepoints, 32 bytes, 0 error)'


-- ?
ooRexx> "0"~text~?("true"~text, "false"~text)=
T'false'
ooRexx> "1"~text~?("true"~text, "false"~text)=
T'true'
ooRexx> "not a boolean value"~text~?("true"~text, "false"~text)=
Logical value must be exactly "0" or "1"; found "not a boolean value".
Error code= 34.901
ooRexx> "not a boolean value ðŸ¤”"~text~?("true"~text, "false"~text)=
UTF-8 not-ASCII 'not a b...' is not compatible with a Rexx logical value.
Error code= 23.900
ooRexx> "0"~text~?("true ðŸ¤”"~text, "false ðŸ¤”"~text)=
T'false ðŸ¤”'
ooRexx> "1"~text~?("true ðŸ¤”"~text, "false ðŸ¤”"~text)=
T'true ðŸ¤”'


-- append
ooRexx> "hello"~text~append(" ")~append("john"~text)=
T'hello john'
ooRexx> "\uD83D"~text("wtf8")~append("\uDE3F")~unescape=    -- High surrogate followed by low surrogate is valid WTF-8
T'ðŸ˜¿'
ooRexx> "\uD83D"~text("utf8")~append("\uDE3F")~unescape=    -- High surrogate followed by low surrogate is INVALID UTF-8
T'í ½í¸¿'


-- c2d
ooRexx> "e"~text~c2d=
 101
ooRexx> "Ã©"~text~c2d=
 50089


-- c2x
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~c2x=
'6E 6F C3AB 6C F09F91A9 E2808D F09F91A8 E2808D F09F91A9 E2808D F09F91A7 F09F8E85'


/*
A caseless method is transforming its arguments using CaseFold.
The default normalization is NFC, it's possible to change it with the argument
normalization
    .unicode~NFC    (default)
    .unicode~NFD
    .unicode~NFKC
    .unicode~NFKD
There is no value NFKC_CF because it can be done using the caseless methods by
passing NFKC + stripIgnorable.
*/


-- caselessCompareTo
ooRexx> "pere noel"~text~caselessCompareTo("PÃ¨re NoÃ«l")=                    -- -1 (lesser)
-1
ooRexx> "pere noel"~text~caselessCompareTo("PÃ¨re NoÃ«l", stripMark:.true)=   --  0 (equal because the accents are ignored)
 0


-- caselessEquals
ooRexx> "Å’UF"~text~caselessEquals("Å“uf")=           -- 1
 1
ooRexx> "Å“uf"~text~caselessEquals("Å’UF")=           -- 1
 1
ooRexx> "StraÃŸe"~text~caselessEquals("strasse")=    -- 1
 1
ooRexx> "strasse"~text~caselessEquals("StraÃŸe")=    -- 1
 1


-- caselessMatch
-- "BundesschnellstraÃŸe"                                    -- at 14: "s", at 18:"ÃŸ"
--  1234567890123456789
ooRexx> "BundesstraÃŸe im Freiland"~text~caselessMatch(14, "im")=    -- .true
 1


-- caselessMatchChar
-- "BundesschnellstraÃŸe"                                    -- at 14: "s", at 18:"ÃŸ"
--  1234567890123456789
ooRexx> "BundesschnellstraÃŸe"~text~caselessMatchChar(18, "s")=      -- 1    "ÃŸ" becomes "ss" which is 2 characters. The first character at 18 matches "s"
 1
ooRexx> "BundesschnellstraÃŸe"~text~caselessMatchChar(19, "s")=      -- 0    "ÃŸ" becomes "ss" which is 2 characters. The character at 19 is "e", not the second "s"
 0
ooRexx> "BundesschnellstraÃŸe"~text~caselessMatchChar(19, "e")=      -- 1    "ÃŸ" becomes "ss" which is 2 characters. The character at 19 is "e", not the second "s"
 1

-- caselessMatchChar (cont.)
-- The ligature disappears when casefolded
ooRexx> "baï¬„e"~text~casefold=                                        -- T'baffle'
T'baffle'
ooRexx> "BAFFLE"~text~caselessMatchChar(3, "ï¬„")=                     -- 1      "ï¬„" becomes "ffl" (3 characters), there is a match on "f" at 3
 1
ooRexx> "BAFFLE"~text~caselessMatchChar(5, "ï¬„")=                     -- 1      "ï¬„" becomes "ffl" (3 characters), there is a match on "l" at 5
 1
ooRexx> "BAFFLE"~text~caselessMatchChar(5, "L")=                      -- 1      there is a match on "l" at 5
 1

-- caselessMatchChar (cont.)
-- Some ligatures are not decomposed by NFKC.
ooRexx> "Å’UF"~text~caselessEquals("oeuf")=                                  -- 0
 0
ooRexx> "Å’UF"~text~caselessEquals("oeuf", normalization:.Unicode~NFKC)=     -- 0
 0


-- center
ooRexx> "noelFC"~text~center(10)=; result~description=              -- forward to String
T'  noelFC  '
'UTF-8 ASCII (10 characters, 10 codepoints, 10 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(10)=; result~description=
T'  noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…  '
'UTF-8 not-ASCII (10 characters, 16 codepoints, 38 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(9)=; result~description=
T' noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…  '
'UTF-8 not-ASCII (9 characters, 15 codepoints, 37 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(8)=; result~description=
T' noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ… '
'UTF-8 not-ASCII (8 characters, 14 codepoints, 36 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(7)=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ… '
'UTF-8 not-ASCII (7 characters, 13 codepoints, 35 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(6)=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
'UTF-8 not-ASCII (6 characters, 12 codepoints, 34 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(5)=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (5 characters, 11 codepoints, 30 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(4)=; result~description=
T'oÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (4 characters, 10 codepoints, 29 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(3)=; result~description=
T'oÃ«l'
'UTF-8 not-ASCII (3 characters, 3 codepoints, 4 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(2)=; result~description=
T'Ã«l'
'UTF-8 not-ASCII (2 characters, 2 codepoints, 3 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(1)=; result~description=
T'Ã«'
'UTF-8 not-ASCII (1 character, 1 codepoint, 2 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(0)=; result~description=
T''
'UTF-8 ASCII (0 character, 0 codepoint, 0 byte, 0 error)'

-- center with pad
ooRexx> "="~description=                                            -- 'UTF-8 ASCII (1 byte)'
'UTF-8 ASCII by default (1 byte)'
ooRexx> "="~c2x=                                                    -- '3D'
'3D'
ooRexx> "noelFC"~text~center(10, "=")=; result~description=         -- forward to String
T'==noelFC=='
'UTF-8 ASCII (10 characters, 10 codepoints, 10 bytes, 0 error)'
ooRexx> "â•"~description=                                            -- 'UTF-8 not-ASCII (3 bytes)'
'UTF-8 not-ASCII by default (3 bytes)'
ooRexx> "â•"~text~description=                                       -- 'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
ooRexx> "â•"~c2x=                                                    -- 'E29590'
'E29590'
ooRexx> "noelFC"~text~center(10, "â•")=; result~description=         -- don't forward to String because the pad is more than 1 byte
T'â•â•noelFCâ•â•'
'UTF-8 not-ASCII (10 characters, 10 codepoints, 18 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(10, "â•")=; result~description=
T'â•â•noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â•â•'
'UTF-8 not-ASCII (10 characters, 16 codepoints, 46 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(9, "â•")=; result~description=
T'â•noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â•â•'
'UTF-8 not-ASCII (9 characters, 15 codepoints, 43 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(8, "â•")=; result~description=
T'â•noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â•'
'UTF-8 not-ASCII (8 characters, 14 codepoints, 40 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(7, "â•")=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â•'
'UTF-8 not-ASCII (7 characters, 13 codepoints, 37 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~center(6, "â•")=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
'UTF-8 not-ASCII (6 characters, 12 codepoints, 34 bytes, 0 error)'


-- contains
ooRexx> "noel"~text~contains("oe")=                 -- forward to String
 1
ooRexx> "noel"~text~contains("oe"~text)=            -- forward to String
 1
ooRexx> "noel"~text~contains("oÃ«")=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noel"~text~contains("oÃ«"~text)=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~contains("oe")=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~contains("oe"~text)=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~contains("oÃ«")=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~contains("oÃ«"~text)=
Message "POSTEXT" did not return a result.
Error code= 91.999


-- copies
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~copies(4)=; result~description=
T'noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…'
'UTF-8 not-ASCII (24 characters, 48 codepoints, 136 bytes, 0 error)'


-- hashCode
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~hashCode~class=
(The String class)
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~hashCode~c2x=
'8FA5DCDA35AE1A58'


-- length
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~length=
 6


-- match
ooRexx> "noel"~text~match(2, "oe")=                 -- forward to String
 1
ooRexx> "noel"~text~match(2, "oe"~text)=            -- forward to String
 1
ooRexx> "noel"~text~match(2, "oÃ«")=
 0
ooRexx> "noel"~text~match(2, "oÃ«"~text)=
 0
ooRexx> "noÃ«l"~text~match(2, "oe")=
 0
ooRexx> "noÃ«l"~text~match(2, "oe"~text)=
 0
ooRexx> "noÃ«l"~text~match(2, "oÃ«")=
 1
ooRexx> "noÃ«l"~text~match(2, "oÃ«"~text)=
 1
ooRexx> "noÃ«l"~text~match(2, "oÃ«l")=
 1
ooRexx> "noÃ«l"~text~match(2, "oÃ«l"~text)=
 1
ooRexx> "noÃ«l"~text~match(3, "Ã«")=
 1
ooRexx> "noÃ«l"~text~match(3, "Ã«"~text)=
 1
ooRexx> "noÃ«l"~text~match(3, "Ã«l")=
 1
ooRexx> "noÃ«l"~text~match(3, "Ã«l"~text)=
 1
ooRexx> "noÃ«l"~text~match(4, "l")=
 1
ooRexx> "noÃ«l"~text~match(4, "l"~text)=
 1


-- matchChar
ooRexx> "noel"~text~matchChar(3, "Ee")=             -- forward to String
 1
ooRexx> "noel"~text~matchChar(3, "Ee"~text)=        -- forward to String
 1
ooRexx> "noel"~text~matchChar(3, "EÃ‹eÃ«")=
 1
ooRexx> "noel"~text~matchChar(3, "EÃ‹eÃ«"~text)=
 1
ooRexx> "noÃ«l"~text~matchChar(3, "EÃ‹eÃ«")=
 1
ooRexx> "noÃ«l"~text~matchChar(3, "EÃ‹eÃ«"~text)=
 1
ooRexx> "noÃ«l"~text~matchChar(3, "EÃ‹eÃ«")=
 1
ooRexx> "noÃ«l"~text~matchChar(3, "Ee", stripMark:)= -- remove the accents from the tested string
 1
ooRexx> "noÃ«l"~text~matchChar(4, "Ll"~text)=
 1
ooRexx> "noÃ«l"~text~matchChar(4, "Ll"~text)=
 1

-- matchChar (cont.)
-- "BundesschnellstraÃŸe"                                    -- at 14: "s", at 18:"ÃŸ"
--  1234567890123456789
ooRexx> "BundesschnellstraÃŸe"~text~matchChar(14, "s")=              -- 1
 1
ooRexx> "BundesschnellstraÃŸe"~text~matchChar(18, "s")=              -- 0
 0
ooRexx> "BundesschnellstraÃŸe"~text~matchChar(18, "ÃŸ")=              -- 1
 1

-- matchChar (cont.)
-- The ligature disappears in NFK[CD] but not in NF[CD]
ooRexx> "baï¬„e"~text~matchChar(3, "f")=                               -- 0     "ï¬„" is ONE character because NFC
 0
ooRexx> "baï¬„e"~text~matchChar(3, "ï¬„")=                              -- 1     "ï¬„" is ONE character because NFC
 1
ooRexx> "baï¬„e"~text~matchChar(3, "ï¬„", normalization:.Unicode~NFKD)= -- 1     "ï¬„" becomes "ffl" (3 characters). There is a match because the first character is "f"
 1
ooRexx> "baï¬„e"~text~matchChar(3, "f", normalization:.Unicode~NFKD)=  -- 1     "ï¬„" becomes "ffl" (3 characters). There is a match because the first character is "f"
 1
ooRexx> "baï¬„e"~text~matchChar(4, "f", normalization:.Unicode~NFKD)=  -- 0     "ï¬„" becomes "ffl" (3 characters). The character at 4 is "e", not the second "f"
 0
ooRexx> "baï¬„e"~text~matchChar(4, "e", normalization:.Unicode~NFKD)=  -- 1     "ï¬„" becomes "ffl" (3 characters). The character at 4 is "e", not the second "f"
 1


-- pos
ooRexx> "noel"~text~pos("oe")=                      -- forward to String
 2
ooRexx> "noel"~text~pos("oe"~text)=                 -- forward to String
 2
ooRexx> "noel"~text~pos("oÃ«")=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noel"~text~pos("oÃ«"~text)=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~pos("oe")=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~pos("oe"~text)=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~pos("oÃ«")=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~pos("oÃ«"~text)=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~pos("l")=
Message "POSTEXT" did not return a result.
Error code= 91.999
ooRexx> "noÃ«l"~text~pos("l"~text)=
Message "POSTEXT" did not return a result.
Error code= 91.999


-- subchar
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~subchar(3)=; result~description=
T'Ã«'
'UTF-8 not-ASCII (1 character, 1 codepoint, 2 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~subchar(4)=; result~description=
T'l'
'UTF-8 ASCII (1 character, 1 codepoint, 1 byte, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~subchar(5)=; result~description=
T'ðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (1 character, 7 codepoints, 25 bytes, 0 error)'


-- substr
ooRexx> "noel"~text~substr(3, 3, "x")=; result~description=   -- forward to String
T'elx'
'UTF-8 ASCII (3 characters, 3 codepoints, 3 bytes, 0 error)'
ooRexx> "noel"~substr(3, 3, "â–·")=; result~description=        -- self is a String: error because the pad character is 3 bytes
Incorrect pad or character argument specified; found "â–·"
Error code= 93.922
ooRexx> "noel"~substr(3, 3, "â–·"~text)=; result~description=   -- self is a String: error because the pad character is not compatible with String
UTF-8 not-ASCII 'â–·' cannot be converted to a String instance.
Error code= 23.900
ooRexx> "noel"~text~substr(3, 3, "â–·")=; result~description=   -- no error because self is a RexxText and the pad character is one character when converted to the default encoding
T'elâ–·'
'UTF-8 not-ASCII (3 characters, 3 codepoints, 5 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~substr(3, 3, "â–·")=; result~description=
T'Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§'
'UTF-8 not-ASCII (3 characters, 9 codepoints, 28 bytes, 0 error)'
ooRexx> "noÃ«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…"~text~substr(3, 6, "â–·")=; result~description=
T'Ã«lðŸ‘©â€ðŸ‘¨â€ðŸ‘©â€ðŸ‘§ðŸŽ…â–·â–·'
'UTF-8 not-ASCII (6 characters, 12 codepoints, 38 bytes, 0 error)'


-- x2c
ooRexx> "F09F9180"~text~x2c=
T'ðŸ‘€'
ooRexx> "not an hexadecimal value"~text~x2c
Only 0-9, a-f, A-F, and whitespace characters are valid in a hexadecimal string; character found "n".
Error code= 93.933
ooRexx> "not an hexadecimal value ðŸ¤”"~text~x2c
UTF-8 not-ASCII 'not an ...' is not compatible with a Rexx hexadecimal value.
Error code= 23.900


---------------------------------------------------------
-- Text encoding - Functional
---------------------------------------------------------

/*
The only needed methods on RexxText are
    ~characters
    ~subwords   (still to implement)
    ~chunks     (still to implement)
*/

/*
Example inspired by https://elixir-lang.org/
Frequency of each character, ignoring the accents:
"Elixir" |> String.graphemes() |> Enum.frequencies()
%{"E" => 1, "i" => 2, "l" => 1, "r" => 1, "x" => 1}
*/

ooRexx> "Notre pÃ¨re NoÃ«l ðŸŽ…"~text~transform(stripMark:)~reduce(by: "characters", initial: .stem~new~~put(0)){accu[item~string] += 1}=
a Stem (9 items)
'ðŸŽ…' :  1
' '    :  3
'e'    :  4
'l'    :  1
'N'    :  2
'o'    :  2
'p'    :  1
'r'    :  2
't'    :  1


---------------------------------------------------------
-- Text encoding - Generator
---------------------------------------------------------

/*
The only needed methods on RexxText are
    ~characters
    ~subwords   (still to implement)
*/

ooRexx> g="NoÃ«l ðŸŽ…"~text~generateC
ooRexx> g~()=       -- T'N'
T'N'
ooRexx> g~()=       -- T'o'
T'o'
ooRexx> g~()=       -- T'Ã«'
T'Ã«'
ooRexx> g~()=       -- T'l'
T'l'
ooRexx> g~()=       -- T' '
T' '
ooRexx> g~()=       -- T'ðŸŽ…'
T'ðŸŽ…'
ooRexx> g~()=       -- [no result]
[no result]


---------------------------------------------------------
-- Text encoding - Compatibility with regular expressions
---------------------------------------------------------

/*
A way to test the compatibility of RexxText with String is to pass instances of
RexxText to the regular expression engine regex.cls, and see what happens...
*/

ooRexx> p = .Pattern~compile("a.c"~text)
ooRexx> p~matches("abc"~text)=
 1
ooRexx> p~matches("aÃ´c"~text)=
 1

ooRexx> p = .Pattern~compile("Ã .c"~text)
UTF-8 not-ASCII 'Ã ' cannot be converted to a String instance.
Error code= 23.900


-----------------------------------------
-- Text encoding - Compatibility with BIF
-----------------------------------------

/*
[Intermediate solution]

Several solutions in RosettaCode are in error because the pad character used
with the function 'center' is a UTF-8 string made of several bytes.
The function center now supports utf-8 pad made of 1 multi-bytes character.
When the pad is not a 1 byte character then the interpreter converts the string
to a RexxText and sends it the message "center".
The returned value is the String associated to the RexxText.

The invariants of the method 'center' are true for the RexxText, but not true for
the String (which is normal).
*/

ooRexx> "â•"~description=                                -- 'UTF-8 not-ASCII (3 bytes)'
'UTF-8 not-ASCII by default (3 bytes)'
ooRexx> "â•"~text~description=                           -- 'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
'UTF-8 not-ASCII (1 character, 1 codepoint, 3 bytes, 0 error)'
ooRexx> "â•"~c2x=                                        -- 'E29590'
'E29590'
ooRexx> center("hello", 20, "â•")=                       -- 'â•â•â•â•â•â•â•helloâ•â•â•â•â•â•â•â•'
'â•â•â•â•â•â•â•helloâ•â•â•â•â•â•â•â•'
ooRexx> center("hello", 20, "â•")~text~description=      -- 'UTF-8 not-ASCII (20 characters, 20 codepoints, 50 bytes, 0 error)'
'UTF-8 not-ASCII (20 characters, 20 codepoints, 50 bytes, 0 error)'

-- Idem for the function 'left'
ooRexx> left("hello", 20, "â•")=                         -- 'helloâ•â•â•â•â•â•â•â•â•â•â•â•â•â•â•'
'helloâ•â•â•â•â•â•â•â•â•â•â•â•â•â•â•'
ooRexx> left("hello", 20, "â•")~text~description=        -- 'UTF-8 not-ASCII (20 characters, 20 codepoints, 50 bytes, 0 error)'
'UTF-8 not-ASCII (20 characters, 20 codepoints, 50 bytes, 0 error)'


/*
[General solution]

The new path I would like to explore is the support of graphemes by ALL the BIF...
I have already a tiny support for center() and left(), only triggered in case of
pad character made of several bytes.

The generalization would be to route the BIF either towards String or towards RexxText,
in function of the compatibility of the arguments with String:
BIF(str1, str2, ..., strN)
    --> forward to String (byte-oriented) if str's encoding is Byte or UTF-8 (with ASCII characters only)
    --> forward to RexxText otherwise
*/

-- UTF-8 encoding

ooRexx> "Noel"~isCompatibleWithByteString=              -- 1
 1
ooRexx> length("Noel")=                                 -- 4 because "Noel"~length = 4
 4
ooRexx> "NoÃ«l"~isCompatibleWithByteString=              -- 0
 0
ooRexx> length("NoÃ«l")=                                 -- TODO: 4 because "NoÃ«l"~text~length = 4
 5
ooRexx> "NoÃ«l"~length=                                  -- 5 because String remains byte-oriented, not impacted by the default encoding
 5

-- UTF-16BE encoding
ooRexx> s = "0041004200430044"x
ooRexx> s=                                              -- '[00]A[00]B[00]C[00]D'
'[00]A[00]B[00]C[00]D'
ooRexx> s~isCompatibleWithByteString=                   -- 1
 1
ooRexx> s~description=                                  -- 'UTF-8 ASCII (8 bytes)'
'UTF-8 ASCII by default (8 bytes)'
ooRexx> length(s)=                                      -- 8 because encoding UTF-8 ASCII is compatible with String
 8
ooRexx> s~encoding = "UTF16"
ooRexx> s~isCompatibleWithByteString=                   -- 0
 0
ooRexx> s~description=                                  -- 'UTF-16BE (8 bytes)'
'UTF-16BE (8 bytes)'
ooRexx> s~length=                                       -- 8 because String is always byte-oriented (ignores the encoding)
 8
ooRexx> length(s)=                                      -- TODO: 4 because forwards to Text (encoding UTF-16BE is not compatible with String)
 8
ooRexx> s~text~utf8=                                    -- ABCD
T'ABCD'

-- UTF-32 encoding
ooRexx> s = "0000004100000042"x
ooRexx> s=                                              -- '[000000]A[000000]B'
'[000000]A[000000]B'
ooRexx> s~isCompatibleWithByteString=                   -- 1
 1
ooRexx> s~description=                                  -- 'UTF-8 ASCII (8 bytes)'
'UTF-8 ASCII by default (8 bytes)'
ooRexx> length(s)=                                      -- 8 because encoding UTF-8 ASCII is compatible with String
 8
ooRexx> s~encoding = "UTF32"
ooRexx> s~isCompatibleWithByteString=                   -- 0
 0
ooRexx> s~description=                                  -- 'UTF-32BE (8 bytes)'
'UTF-32BE (8 bytes)'
ooRexx> s~length=                                       -- 8 because String is always byte-oriented (ignores the encoding)
 8
ooRexx> length(s)=                                      -- TODO: 2 because forwards to Text (encoding UTF-32 is not compatible with String)
 8
ooRexx> s~text~utf8=                                    -- AB
T'AB'


/*
End of demonstration.
*/
