loadPackage OK for extension/stringChunk.cls
loadPackage OK for utilities/indentedStream.cls
loadPackage OK for extension/extensions.cls
loadLibrary OK for rxunixsys
loadPackage OK for ncurses.cls
loadPackage OK for csvStream.cls
loadLibrary OK for hostemu
loadPackage OK for json.cls
loadPackage OK for mime.cls
loadPackage OK for rxftp.cls
loadLibrary OK for rxmath
loadPackage OK for rxregexp.cls
loadPackage OK for regex/regex.cls
loadPackage OK for smtp.cls
loadPackage OK for socket.cls
loadPackage OK for streamsocket.cls
loadPackage OK for pipeline/pipe.cls
loadPackage OK for rgf_util2/rgf_util2.rex
loadPackage OK for BSF.CLS
loadPackage OK for oorexxshell_queries.cls
loadPackage OK for pipeline/pipe_extension.cls
loadPackage OK for rgf_util2/rgf_util2_wrappers.rex

REXX-ooRexx_4.3.0(MT)_64-bit 6.04 5 Nov 2022
Input queue name: S24abQ7fada1c49c10

--------------
-- ooRexxShell
--------------

/*
ooRexxShell, derived from rexxtry.
*/

/*
This shell supports several interpreters:
- ooRexx itself
- the system address (cmd under Windows, sh or bash under Linux and MacOs)
- PowerShell core (pwsh)
- any other external environment (you need to modify ooRexxShell, search for hostemu for an example).
*/

/*
The prompt indicates which interpreter is active.
By default the shell is in ooRexx mode: ooRexx[bash]>
When the interpreter is ooRexx, the value of address() is displayed between [].
*/
ooRexx[sh]> say "hello"
hello
ooRexx[sh]> say 1+2
3
ooRexx[sh]> 
/*
If an ooRexx clause ends with "=" then the clause is transformed to display the result :
'1+2=' becomes 'options "NOCOMMANDS"; 1+2 ; call dumpResult; options "COMMANDS"'
'=' alone displays the current value of the variable RESULT.
*/
ooRexx[sh]> 1+2=
 3
ooRexx[sh]> (1,2)=          -- When "=" then the arrays are displayed in condensed form
[ 1, 2]
ooRexx[sh]> (1,2)==         -- When "==" then the arrays are displayed one item per line
an Array (shape [2], 2 items)
 1 :  1
 2 :  2
ooRexx[sh]> 
/*
You have access to Java.
*/
ooRexx[sh]> jsystem = bsf.loadClass('java.lang.System')
ooRexx[sh]> properties = jsystem~getProperties
ooRexx[sh]> enum = properties~propertyNames
ooRexx[sh]> do while enum~hasMoreElements; key=enum~nextElement; say "key:" left("["key"]",30) "value: ["properties~getProperty(key)"]"; end
key: [java.runtime.name]            value: [OpenJDK Runtime Environment]
key: [java.vm.version]              value: [17.0.4.1+1-LTS]
key: [sun.boot.library.path]        value: [/local/java/jdk/bellsoft/jdk-17.0.4.1-full.jdk/lib]
key: [java.vm.vendor]               value: [BellSoft]
key: [java.vendor.url]              value: [https://bell-sw.com/]
key: [path.separator]               value: [:]
key: [java.vm.name]                 value: [OpenJDK 64-Bit Server VM]
key: [user.country]                 value: [FR]
key: [java.vm.specification.name]   value: [Java Virtual Machine Specification]
key: [user.dir]                     value: [/local/rexx/oorexx/executor/sandbox/jlf/demos]
key: [java.vm.compressedOopsMode]   value: [Zero based]
key: [java.runtime.version]         value: [17.0.4.1+1-LTS]
key: [os.arch]                      value: [x86_64]
key: [java.io.tmpdir]               value: [/var/folders/f6/ls9l793n1bg444403jmfh1_m0000gp/T/]
key: [line.separator]               value: [
]
key: [java.vm.specification.vendor] value: [Oracle Corporation]
key: [os.name]                      value: [Mac OS X]
key: [sun.jnu.encoding]             value: [UTF-8]
key: [java.library.path]            value: [/local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/lib:/local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/install/64:]
key: [jdk.debug]                    value: [release]
key: [java.class.version]           value: [61.0]
key: [java.specification.name]      value: [Java Platform API Specification]
key: [sun.management.compiler]      value: [HotSpot 64-Bit Tiered Compilers]
key: [os.version]                   value: [10.13.6]
key: [http.nonProxyHosts]           value: [local|*.local|169.254/16|*.169.254/16]
key: [user.home]                    value: [/Users/jlfaucher]
key: [file.encoding]                value: [UTF-8]
key: [java.specification.version]   value: [17]
key: [user.name]                    value: [jlfaucher]
key: [java.class.path]              value: [/local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/bsf4ooRexx-v641-20220131-bin.jar:]
key: [java.vm.specification.version value: [17]
key: [sun.arch.data.model]          value: [64]
key: [java.home]                    value: [/local/java/jdk/bellsoft/jdk-17.0.4.1-full.jdk]
key: [user.language]                value: [en]
key: [java.specification.vendor]    value: [Oracle Corporation]
key: [java.vm.info]                 value: [mixed mode, sharing]
key: [java.version]                 value: [17.0.4.1]
key: [native.encoding]              value: [UTF-8]
key: [java.vendor]                  value: [BellSoft]
key: [java.awt.headless]            value: [true]
key: [sun.stderr.encoding]          value: [UTF-8]
key: [file.separator]               value: [/]
key: [java.version.date]            value: [2022-08-12]
key: [java.vendor.url.bug]          value: [https://bell-sw.com/support]
key: [sun.io.unicode.encoding]      value: [UnicodeBig]
key: [sun.cpu.endian]               value: [little]
key: [sun.stdout.encoding]          value: [UTF-8]
key: [socksNonProxyHosts]           value: [local|*.local|169.254/16|*.169.254/16]
key: [ftp.nonProxyHosts]            value: [local|*.local|169.254/16|*.169.254/16]
ooRexx[sh]> 
/*
A shell command can be used in ooRexx mode, surrounded with quotes.
*/
ooRexx[sh]> 'ls -lap *demo*.txt'
-rw-r--r--@ 1 jlfaucher  admin    1190 Nov  5 22:06 _readme-demos.txt
-rw-r--r--@ 1 jlfaucher  admin    8827 Nov 17 19:02 executor-demo-array-output.txt
-rw-r--r--@ 1 jlfaucher  admin  304924 Nov 17 19:02 executor-demo-classic_rexx-output.txt
-rw-r--r--@ 1 jlfaucher  admin   47754 Nov 17 19:02 executor-demo-extensions-output.txt
-rw-r--r--@ 1 jlfaucher  admin   20593 Nov 17 19:02 executor-demo-text-compatibility-output.txt
-rw-r--r--@ 1 jlfaucher  admin   22785 Nov 17 19:02 executor-demo-text-internal_checks-output.txt
-rw-r--r--@ 1 jlfaucher  admin   20664 Nov 17 19:02 executor-demo-text-output.txt
-rw-r--r--@ 1 jlfaucher  admin   54659 Nov 17 19:02 executor-demo-text-unicode-output.txt
-rw-r--r--@ 1 jlfaucher  admin    4925 Nov 17 19:02 ooRexxShell-demo-helpers-output.txt
-rw-r--r--@ 1 jlfaucher  admin   16104 Nov 17 19:02 ooRexxShell-demo-interpreters-output.txt
-rw-r--r--@ 1 jlfaucher  admin  520751 Nov 17 19:02 ooRexxShell-demo-queries-output.txt
ooRexx[sh]> 
/*
When not in ooRexx mode, you enter raw commands that are passed directly to the external environment.
You switch from an interpreter to an other one by entering its name alone.
To get the list of all interpreter names, enter this command:
?i[nterpreters]
Under Linux & MacOs, this list includes the shells in /etc/shells.
*/
ooRexx[sh]> ?interpreters
Interpreters:
    bash: to activate the bash interpreter.
    cmd: to activate the sh interpreter.
    command: to activate the sh interpreter.
    csh: to activate the csh interpreter.
    hostemu: to activate the HostEmu interpreter.
    ksh: to activate the ksh interpreter.
    oorexx: to activate the ooRexx interpreter.
    pwsh: to activate the pwsh interpreter.
    screen: to activate the screen interpreter.
    sh: to activate the sh interpreter.
    system: to activate the sh interpreter.
    tcsh: to activate the tcsh interpreter.
    zsh: to activate the zsh interpreter.
[Info] 14 lines displayed
ooRexx[sh]> 
/*
'cmd' 'command' and "system" are aliases to select the system interpreter.
*/
ooRexx[sh]> system
sh[ooRexx]> 
/*
Now the default interpreter is the system shell.
No need to surround the commands with quotes.
*/
sh[ooRexx]> ls -lap *demo*.cast
-rw-r--r--  1 jlfaucher  admin   43255 Nov 17 17:50 executor-demo-array.cast
-rw-r--r--  1 jlfaucher  admin  388619 Nov 17 17:56 executor-demo-classic_rexx.cast
-rw-r--r--  1 jlfaucher  admin  120053 Nov 17 18:05 executor-demo-extensions.cast
-rw-r--r--  1 jlfaucher  admin  165209 Nov 17 18:54 executor-demo-text-compatibility.cast
-rw-r--r--  1 jlfaucher  admin  151218 Nov 17 18:26 executor-demo-text-internal_checks.cast
-rw-r--r--  1 jlfaucher  admin  201596 Nov 17 18:39 executor-demo-text-unicode.cast
-rw-r--r--  1 jlfaucher  admin  113145 Nov 17 18:17 executor-demo-text.cast
-rw-r--r--  1 jlfaucher  admin   11014 Nov 17 18:55 ooRexxShell-demo-helpers.cast
-rw-r--r--  1 jlfaucher  admin   22792 Nov 17 20:53 ooRexxShell-demo-interpreters.cast
-rw-r--r--  1 jlfaucher  admin  618081 Nov 17 19:02 ooRexxShell-demo-queries.cast
sh[ooRexx]> 
/*
HostEmu is a subcommand environment that partially emulates a TSO/CMS environment.
*/
sh[ooRexx]> hostemu
HostEmu[ooRexx]> 
/*
Now the default interpreteur is HostEmu.
No need to surround the commands with quotes.
*/
HostEmu[ooRexx]> 
/*
EXECIO is an I/O mechanism.
The following command will read the 10 first lines from the file "_readme-demos.txt".
They are stored in the stem named "lines.".
*/
HostEmu[ooRexx]> execio 10 diskr "_readme-demos.txt" (finis stem lines.
HostEmu[ooRexx]> 
/*
When in HostEmu mode, the ooRexx expressions are not recognized
*/
HostEmu[ooRexx]> lines.=
hostemu: bad PLIST, token "syntax error"
RC= 24
HostEmu[ooRexx]> 
/*
You can switch temporarily to ooRexx to display the result.
For that, start your command line with "oorexx".
*/
HostEmu[ooRexx]> oorexx lines.=
a Stem (11 items)
 0  :  10
 1  : 'Demonstration scripts.'
 2  : 'ooRexxShell has a demo mode with slow display.'
 3  : ''
 4  : 'https://asciinema.org/              asciinema   Terminal session recorder'
 5  : 'https://github.com/theZiz/aha       aha         Ansi HTML Adapter.'
 6  : ''
 7  : 'Current demos:'
 8  : 'executor-demo-array.rex'
 9  : 'executor-demo-classic_rexx.rex'
 10 : 'executor-demo-extensions.rex'
HostEmu[ooRexx]> 
/*
Switch to PowerShell core.
pwsh
*/
HostEmu[ooRexx]> pwsh
pwsh[ooRexx]> 
/*
Now the default interpreter is pwsh.
No need to surround the commands with quotes.
*/

/*
Find the commands containing "rexx":
*/
pwsh[ooRexx]> get-command *rexx* | select -property name, source

Name                             Source
----                             ------
bsf4ooRexx-v641-20220131-bin.jar /local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/bsf4ooRexx-v641-20220131-…
callrexx1                        /local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/…
callrexx2                        /local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/…
oorexxshell                      /local/rexx/oorexx/executor/incubator/ooRexxShell/oorexxshell
oorexx_collect_docfiles          /local/rexx/builder/scripts/oorexx_collect_docfiles
oorexx_vars                      /local/rexx/builder/scripts/oorexx_vars
refcardBSF4ooRexx.pdf            /local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/refcardBSF4ooRexx.pdf
rexx                             /local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/…
rexx.cat                         /local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/…
rexx.img                         /local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/…
rexxc                            /local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/…
rexxcUtil.rex                    /local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxcUtil.rex
rexxj2-32.sh                     /local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxj2-32.sh
rexxj2-64.sh                     /local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxj2-64.sh
rexxj2.cmd                       /local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxj2.cmd
rexxj2.sh                        /local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxj2.sh
rexxscriptlib.rex                /local/rexx/builder/scripts/rexxscriptlib.rex
rexxtry.rex                      /local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/…
setenv-oorexx                    /local/rexx/builder/scripts/setenv-oorexx
testOORexx.rex                   /local/rexx/oorexx/official/test/trunk/testOORexx.rex

pwsh[ooRexx]> 
/*
Same command, send the output to the rexx queue without the table headers.
The empty lines are still in the output, they will be filtered on ooRexx side.
*/
pwsh[ooRexx]> get-command *rexx* | select -property name, source | format-table -HideTableHeaders | rxqueue
pwsh[ooRexx]> 
/*
Collect the lines of the rexx queue in an array, and then parse the lines to create an ooRexx directory.
*/
pwsh[ooRexx]> oorexx .rexxqueue~new~makearray~select{item <> ""}~reduce(.directory~new){parse value item~space with name source; accu[name]=source}=
a Directory (20 items)
'bsf4ooRexx-v641-20220131-bin.jar' : '/local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/bsf4ooRexx-v641-20220131-b…'
'callrexx1'                        : '/local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/c…'
'callrexx2'                        : '/local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/c…'
'oorexxshell'                      : '/local/rexx/oorexx/executor/incubator/ooRexxShell/oorexxshell'
'oorexx_collect_docfiles'          : '/local/rexx/builder/scripts/oorexx_collect_docfiles'
'oorexx_vars'                      : '/local/rexx/builder/scripts/oorexx_vars'
'refcardBSF4ooRexx.pdf'            : '/local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/refcardBSF4ooRexx.pdf'
'rexx'                             : '/local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/r…'
'rexx.cat'                         : '/local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/r…'
'rexx.img'                         : '/local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/r…'
'rexxc'                            : '/local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/r…'
'rexxcUtil.rex'                    : '/local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxcUtil.rex'
'rexxj2-32.sh'                     : '/local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxj2-32.sh'
'rexxj2-64.sh'                     : '/local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxj2-64.sh'
'rexxj2.cmd'                       : '/local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxj2.cmd'
'rexxj2.sh'                        : '/local/rexx/bsf4oorexx/BSF4ooRexx_install_v641-20220131-ga/bsf4oorexx/rexxj2.sh'
'rexxscriptlib.rex'                : '/local/rexx/builder/scripts/rexxscriptlib.rex'
'rexxtry.rex'                      : '/local/rexx/oorexx/build/executor.master/sandbox/jlf/trunk/macos/clang/release/64/delivery/bin/r…'
'setenv-oorexx'                    : '/local/rexx/builder/scripts/setenv-oorexx'
'testOORexx.rex'                   : '/local/rexx/oorexx/official/test/trunk/testOORexx.rex'
pwsh[ooRexx]> 
/*
Back to the ooRexx interpreter, by entering "oorexx" alone.
*/
pwsh[ooRexx]> oorexx
ooRexx[sh]> say "The default interpreter is now ooRexx"
The default interpreter is now ooRexx
ooRexx[sh]> 
/*
End of demonstration.
*/

